# 작업 1유형

### 1-1
Temperature컬럼에서 숫자가 아닌 문자들을 제거후 숫자 타입으로 바꾸고 3분위수에서 1분위수의 차이를 소숫점 이하 2자리까지 구하여라

In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_1.csv')
df.head(5)

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.5,2.625,211.350143,8.106

In [29]:
df['Temperature_f'] = df.Temperature.str.replace('*','')
df['Temperature_f'] = df['Temperature_f'].astype('float64')
print(round(df['Temperature_f'].quantile(q=0.75) - df['Temperature_f'].quantile(q=0.25),2))

27.48

In [26]:
## answer
df.loc[:,'Temperature_f'] = df['Temperature'].str.replace('*','',regex=True).astype('float')
result = round(df['Temperature_f'].quantile(0.75) -df['Temperature_f'].quantile(0.25),3)
print(result)

     Store        Date  Weekly_Sales  Holiday_Flag Temperature  Fuel_Price  \
120      1  25-05-2012    1555444.55             0      *77.22       3.561
250      2  24-02-2012    1861802.70             0      *54.63       3.555
257      2  13-04-2012    1935869.10             0      *68.08       3.891
259      2  27-04-2012    1764133.09             0       *67.2       3.814
338      3  04-02-2011     438516.53             0      *45.95       2.989
399      3  06-04-2012     503232.13             0      *73.01       3.891
423      3  21-09-2012     414392.09             0      *72.78       3.721
424      3  28-09-2012     389813.02             0      *77.46       3.666
475      4  24-12-2010    3526713.39             0      *43.21       2.887
481      4  04-02-2011    2119086.04             0      *34.61       2.996
505      4  22-07-2011    2036231.39             0      *82.84       3.627
539      4  16-03-2012    2214967.44             0      *59.81       3.707
606      5  01-10-2010     283178.12             0       *71.1       2.603
644      5  24-06-2011     302881.64             0      *84.76       3.594
651      5  12-08-2011     289886.16             0      *90.16       3.638
660      5  14-10-2011     286117.72             0      *72.36       3.274
661      5  21-10-2011     306069.18             0       *66.9       3.353
663      5  04-11-2011     353652.23             0      *56.71       3.332
665      5  18-11-2011     307944.37             0      *64.33       3.308
682      5  16-03-2012     339392.54             0      *63.55       3.734
715      6  05-02-2010    1652635.10             0      *40.43       2.572
790      6  15-07-2011    1526801.24             0      *88.93       3.575
835      6  25-05-2012    1603793.42             0      *78.47       3.561
875      7  04-06-2010     509183.22             0      *53.63       2.700
876      7  11-06-2010     498580.87             0      *63.59       2.684
918      7  01-04-2011     513409.67             0      *24.83       3.461
941      7  09-09-2011     613135.23             1      *45.61       3.566
953      7  02-12-2011     591907.88             0      *20.38       3.378
960      7  20-01-2012     578002.85             0      *27.41       3.055
969      7  23-03-2012     615997.29             0      *35.06       3.664

            CPI  Unemployment
120  221.744944         7.143
250  220.275944         7.057
257  221.148403         6.891
259  221.255812         6.891
338  215.886337         7.551
399  224.939340         6.664
423  226.315150         6.334
424  226.518093         6.334
475  126.983581         7.127
481  127.719581         6.510
505  129.150774         5.644
539  130.826193         4.607
606  212.226946         6.768
644  215.653958         6.489
651  216.167803         6.529
660  217.923746         6.300
661  218.085300         6.300
663  218.408408         6.300
665  218.793912         6.300
682  221.798971         5.943
715  212.622352         7.259
790  216.904473         6.925
835  223.352566         5.964
875  189.422658         8.963
876  189.400073         8.963
918  192.269171         8.595
941  194.638785         8.622
953  195.822329         8.513
960  196.779665         8.256
969  197.229523         8.256

In [31]:
#### 숫자로 변환할 수 있는 값 찾기
pd.to_numeric(df['Temperature'], errors='coerce').isnull()  
# errors='coerce':숫자 변환 불가한 값을 NaN으로 처리
# isnull()로 숫자 변환 불가한 값 처리 가능

0       False
1       False
2       False
3       False
4       False
        ...
6430    False
6431    False
6432    False
6433    False
6434    False
Name: Temperature, Length: 6435, dtype: bool

### 1-2
Likes를 Comments로 나눈 비율이 20이상이면서 Keyword값이 minecraft인 영상들의 Views값의 평균을 정수로 구하여라

In [32]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_2.csv')
df.head(5)

,Title,Video ID,Published At,Keyword,Likes,Comments,Views
0,Apple Pay Is Killing the Physical Wallet After...,wAZZ-UWGVHI,2022-08-23,tech,3407.0,672.0,135612.0
1,The most EXPENSIVE thing I own.,b3x28s61q3c,2022-08-24,tech,76779.0,4306.0,1758063.0
2,My New House Gaming Setup is SICK!,4mgePWWCAmA,2022-08-23,tech,63825.0,3338.0,1564007.0
3,Petrol Vs Liquid Nitrogen | Freezing Experimen...,kXiYSI7H2b0,2022-08-23,tech,71566.0,1426.0,922918.0
4,Best Back to School Tech 2022!,ErMwWXQxHp0,2022-08-08,tech,96513.0,5155.0,1855644.0

In [37]:
df['ratio'] = df['Likes']/df['Comments']
print(int(df[(df['ratio'] >= 20)&(df['Keyword']=='minecraft')].Views.mean()))

1789084

### 1-3
date_added가 2018년 1월 이면서 country가 United Kingdom 단독 제작인 데이터의 갯수

In [40]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_3.csv')
df.head(5)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...

In [76]:
result = df[df.date_added.str.startswith('Jan') & df.date_added.str.endswith('2018')]
print(len(result[result.country=='United Kingdom'].index))

5

# 작업 2유형
Segmentation 클래스 예측, 평가지표 macro f1 score

In [101]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_train.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_test.csv')

display(train.head(2))
test.head(2)

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,464357,Male,No,40,Yes,Artist,7.0,Low,1.0,Cat_6,A
1,459624,Male,No,18,No,Healthcare,NaN,Low,5.0,Cat_4,D

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,460406,Male,Yes,36,Yes,Healthcare,3.0,Low,2.0,Cat_6
1,466890,Male,Yes,47,Yes,Artist,0.0,Average,6.0,Cat_7

In [106]:
# print(train.info(), test.info())  
# # object column : Gender, Ever_Married, Graduated, Spending_Score
# print()
# print(train.isna().sum(), '\n', test.isna().sum())  # 결측값 많음

drop_cols = ['ID', 'Profession', 'Var_1']  # train은 Segmentation도 제외
train_d = train.drop(columns = ['ID', 'Profession', 'Var_1', 'Segmentation'])
test_d = test.drop(columns = drop_cols)

## 결측치 최빈값으로 대체 : Ever_Married, Graduated, Work_Experience, Family_Size
# print(train_d[['Ever_Married', 'Graduated', 'Work_Experience', 'Family_Size']].nunique())
# print(test_d[['Ever_Married', 'Graduated', 'Work_Experience', 'Family_Size']].nunique())
train_d['Ever_Married'] = train_d['Ever_Married'].fillna(train_d['Ever_Married'].mode()[0])
train_d['Graduated'] = train_d['Graduated'].fillna(train_d['Graduated'].mode()[0])
train_d['Work_Experience'] = train_d['Work_Experience'].fillna(train_d['Work_Experience'].mode()[0])
train_d['Family_Size'] = train_d['Family_Size'].fillna(train_d['Family_Size'].mode()[0])

test_d['Ever_Married'] = test_d['Ever_Married'].fillna(test_d['Ever_Married'].mode()[0])
test_d['Graduated'] = test_d['Graduated'].fillna(test_d['Graduated'].mode()[0])
test_d['Work_Experience'] = test_d['Work_Experience'].fillna(test_d['Work_Experience'].mode()[0])
test_d['Family_Size'] = test_d['Family_Size'].fillna(test_d['Family_Size'].mode()[0])

# print(test_d.isna().sum(), train_d.isna().sum())

## 원핫인코딩
train_dd = pd.get_dummies(train_d)
test_dd = pd.get_dummies(test_d)
test_dd = test_dd[train_dd.columns]
y = train.Segmentation

from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import f1_score

X_train, X_val, y_train, y_val = train_test_split(train_dd, y, test_size=0.3, stratify=y, random_state=0)
rfc = RandomForestClassifier(random_state=0)
rfc.fit(X_train, y_train)

## 예측 및 성능평가
val_pred = rfc.predict(X_val)
pred = rfc.predict(test_dd)

print('val f1_score:', f1_score(y_val, val_pred, average='micro'))
pd.DataFrame({'ID':test.ID, 'Segmentation':pred}).to_csv('results/test4_recsult.csv', index=False)

Gender             0
Ever_Married       0
Age                0
Graduated          0
Work_Experience    0
Spending_Score     0
Family_Size        0
dtype: int64 Gender             0
Ever_Married       0
Age                0
Graduated          0
Work_Experience    0
Spending_Score     0
Family_Size        0
dtype: int64
val f1_score: 0.39044368600682594

# 작업 3유형

### 학과와 성별이 독립적인지 여부 확인, 카이제곱 독립성 검정 실시

In [107]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p3_1_.csv')
df.head()

         학번     학과 성별
0  DFSKJK_1   경영학과  여
1  DFSKJK_2   사회학과  여
2  DFSKJK_3  기계공학과  여
3  DFSKJK_4   경제학과  남
4  DFSKJK_5  기계공학과  여

### 3-1-a
학과 평균 인원에 대한 값을 소숫점 이하 3자리까지 구하여라

In [119]:
result = df.groupby('학과').학번.count().to_frame('인원')
print(round(result.인원.sum()/len(result.index),3))

170.333

### 3-1-b
카이제곱검정 독립성 검정 통계량을 소숫점 이하 3자리까지 구하여라

In [121]:
from scipy.stats import chi2_contingency
cdf = pd.crosstab(df.학과, df.성별)
statistics, pvalue, dof, expected_freq = chi2_contingency(cdf)
print(round(statistics, 3))

5.646

### 3-1-c
카이제곱검정 독립성 검정의 pvalue를 소숫점 이하 3자리까지 구하여라. 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 것을 출력하라

In [122]:
print(round(pvalue,3))
print('귀무가설')

0.342
귀무가설

### 3-2-a
어느 학교에서 수학 시험을 본 학생 100명 중 60명이 60점 이상을 받았다. 이 학교의 수학 시험의 평균 점수가 50점 이상인지 95%의 신뢰 수준에서 검정하려한다.

In [123]:
import numpy as np
n = 100
p_hat = 0.6
p = 0.5
alpha = 0.05

# 검정 통계량 계산
z = round((p_hat - p) / np.sqrt(p * (1 - p) / n),5)
print(z)

2.0

### 3-2-b
pvalue를 소숫점 이하 3자리까지 구하고 귀무가설과 대립가설중 유의한 것을 출력하라

In [124]:
from scipy.stats import norm
p_value = round(1 - norm.cdf(z),3)

print(p_value)
print('대립')

0.023
대립